In [4]:
import pandas as pd

#### Read Salaries.csv as a dataframe called sal.**

In [5]:
sal=pd.read_csv('Salaries.csv')

C:\Users\Unmesh Dattatray\AppData\Local\Temp\ipykernel_11744\84743563.py:1: DtypeWarning: Columns (3,4,5,6,12) have mixed types. Specify dtype option on import or set low_memory=False.
  sal=pd.read_csv('Salaries.csv')

#### Check the head of the DataFrame. **

In [3]:
pd.DataFrame(sal).head(5)

,Id,EmployeeName,JobTitle,BasePay,OvertimePay,OtherPay,Benefits,TotalPay,TotalPayBenefits,Year,Notes,Agency,Status
0,1,NATHANIEL FORD,GENERAL MANAGER-METROPOLITAN TRANSIT AUTHORITY,167411.18,0.0,400184.25,NaN,567595.43,567595.43,2011,NaN,San Francisco,NaN
1,2,GARY JIMENEZ,CAPTAIN III (POLICE DEPARTMENT),155966.02,245131.88,137811.38,NaN,538909.28,538909.28,2011,NaN,San Francisco,NaN
2,3,ALBERT PARDINI,CAPTAIN III (POLICE DEPARTMENT),212739.13,106088.18,16452.6,NaN,335279.91,335279.91,2011,NaN,San Francisco,NaN
3,4,CHRISTOPHER CHONG,WIRE ROPE CABLE MAINTENANCE MECHANIC,77916.0,56120.71,198306.9,NaN,332343.61,332343.61,2011,NaN,San Francisco,NaN
4,5,PATRICK GARDNER,"DEPUTY CHIEF OF DEPARTMENT,(FIRE DEPARTMENT)",134401.6,9737.0,182234.59,NaN,326373.19,326373.19,2011,NaN,San Francisco,NaN

#### ** Use the .info() method to find out how many entries there are.**

In [11]:
sal.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 148654 entries, 0 to 148653
Data columns (total 13 columns):
 #   Column            Non-Null Count   Dtype
---  ------            --------------   -----
 0   Id                148654 non-null  int64
 1   EmployeeName      148654 non-null  object
 2   JobTitle          148654 non-null  object
 3   BasePay           148049 non-null  object
 4   OvertimePay       148654 non-null  object
 5   OtherPay          148654 non-null  object
 6   Benefits          112495 non-null  object
 7   TotalPay          148654 non-null  float64
 8   TotalPayBenefits  148654 non-null  float64
 9   Year              148654 non-null  int64
 10  Notes             0 non-null       float64
 11  Agency            148654 non-null  object
 12  Status            38119 non-null   object
dtypes: float64(3), int64(2), object(8)
memory usage: 14.7+ MB

In [36]:
sal.dtypes

Id                    int64
EmployeeName         object
JobTitle             object
BasePay              object
OvertimePay          object
OtherPay             object
Benefits             object
TotalPay            float64
TotalPayBenefits    float64
Year                  int64
Notes               float64
Agency               object
Status               object
dtype: object

#### **What is the average BasePay ?**

In [13]:
BasePay_Column=pd.to_numeric(sal['BasePay'],errors='coerce')
BasePay_Column.fillna(value=BasePay_Column.mean()).mean()

66325.44884050524

#### ** What is the highest amount of OvertimePay in the dataset ? **

In [63]:
OvertimePay_Column=pd.to_numeric(sal['OvertimePay'],errors='coerce')
OvertimePay_Column.max()

245131.88

#### ** What is the job title of  JOSEPH DRISCOLL ? Note: Use all caps, otherwise you may get an answer that doesn't match up (there is also a lowercase Joseph Driscoll). **

In [79]:
Title=sal[(sal['EmployeeName']=='JOSEPH DRISCOLL')& sal['JobTitle']]
Title['JobTitle']

24    CAPTAIN, FIRE SUPPRESSION
Name: JobTitle, dtype: object

#### ** How much does JOSEPH DRISCOLL make (including benefits)? ****

In [94]:
Benefit=sal[(sal['EmployeeName']=='JOSEPH DRISCOLL')& sal['JobTitle']]
Benefit['TotalPayBenefits']

24    270324.91
Name: TotalPayBenefits, dtype: float64

#### ** What is the name of highest paid person (including benefits)?**

In [122]:
sal1=sal[sal['TotalPayBenefits']==sal['TotalPayBenefits'].max()]
sal1

,Id,EmployeeName,JobTitle,BasePay,OvertimePay,OtherPay,Benefits,TotalPay,TotalPayBenefits,Year,Notes,Agency,Status
0,1,NATHANIEL FORD,GENERAL MANAGER-METROPOLITAN TRANSIT AUTHORITY,167411.18,0.0,400184.25,NaN,567595.43,567595.43,2011,NaN,San Francisco,NaN

#### ** What is the name of lowest paid person (including benefits)? Do you notice something strange about how much he or she is paid?**** What is the name of lowest paid person (including benefits)? Do you notice something strange about how much he or she is paid?**

In [124]:
sal1=sal[sal['TotalPayBenefits']==sal['TotalPayBenefits'].min()]
sal1

,Id,EmployeeName,JobTitle,BasePay,OvertimePay,OtherPay,Benefits,TotalPay,TotalPayBenefits,Year,Notes,Agency,Status
148653,148654,Joe Lopez,"Counselor, Log Cabin Ranch",0.00,0.00,-618.13,0.00,-618.13,-618.13,2014,NaN,San Francisco,PT

#### What was the average (mean) BasePay of all employees per year? (2011-2014) ? **

In [223]:

sal1=pd.to_numeric(sal['BasePay'],errors='coerce')
sal2=sal1.fillna(value=sal1.mean())
sal3=sal['Year']
sal4=pd.concat([sal3,sal2],axis=1)
sal5=sal4.groupby('Year').mean()
sal5

           BasePay
Year
2011  63595.956517
2012  65436.406857
2013  69576.866579
2014  66564.396851

#### ** How many unique job titles are there? **

In [311]:
salary=sal.groupby('JobTitle').count()
len(salary)

2159

#### ** What are the top 5 most common jobs? **

In [7]:
salary1=sal.groupby('JobTitle').count()
salary1.sort_values(by=['Id'],ascending=False).head(5)

,Id,EmployeeName,BasePay,OvertimePay,OtherPay,Benefits,TotalPay,TotalPayBenefits,Year,Notes,Agency,Status
JobTitle,,,,,,,,,,,,
Transit Operator,7036,7036,6975,7036,7036,7036,7036,7036,7036,0,7036,2479
Special Nurse,4389,4389,4382,4389,4389,4389,4389,4389,4389,0,4389,1478
Registered Nurse,3736,3736,3725,3736,3736,3736,3736,3736,3736,0,3736,1234
Public Svc Aide-Public Works,2518,2518,2514,2518,2518,2518,2518,2518,2518,0,2518,916
Police Officer 3,2421,2421,2411,2421,2421,2421,2421,2421,2421,0,2421,783

#### ** How many Job Titles were represented by only one person in 2013? (e.g. Job Titles with only one occurence in 2013?) **

#### ** How many people have the word Chief in their job title? (This is pretty tricky) **

In [6]:
def chief_string(title):
    if 'Chief' in title:
        return True
    else:
        return False

In [17]:
sum(sal['JobTitle'].apply(lambda x: chief_string(x)))

423

#### ** Bonus: Is there a correlation between length of the Job Title string and Salary? **